; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v1 - type_3 ?v6 - type_1)
 	      (pred_3 ?v8 - object ?v6 - type_1)
	      (pred_1 ?v1 - type_3 ?v5 - type_2)
	      (pred_4 ?v1 - type_3 ?v8 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v1 - type_3 ?v7 ?v4 - type_1)
       :precondition (and  (pred_2 ?v1 ?v7))
       :effect (and  (pred_2 ?v1 ?v4)
		     (not (pred_2 ?v1 ?v7))))

   (:action op_1
       :parameters (?v1 - type_3 ?v3 - object ?v2 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v2) (pred_2 ?v1 ?v2) (pred_1 ?v1 ?v5))
       :effect (and (pred_4 ?v1 ?v3 ?v5)
		    (not (pred_3 ?v3 ?v2)) 
		    (not (pred_1 ?v1 ?v5))))

   (:action op_3
       :parameters (?v1 - type_3 ?v3 - object ?v2 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v3 ?v5) (pred_2 ?v1 ?v2))
       :effect (and (pred_3 ?v3 ?v2)
		    (pred_1 ?v1 ?v5)
		    (not (pred_4 ?v1 ?v3 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_09 - type_3
obj_10 obj_12 obj_08 obj_05 - type_2
obj_03 obj_06 obj_11 obj_07 - type_1
obj_02 obj_04 obj_01 - object)
(:init
(pred_2 obj_13 obj_11)
(pred_1 obj_13 obj_10)
(pred_1 obj_13 obj_12)
(pred_2 obj_09 obj_06)
(pred_1 obj_09 obj_08)
(pred_1 obj_09 obj_05)
(pred_3 obj_02 obj_06)
(pred_3 obj_04 obj_11)
(pred_3 obj_01 obj_03)
)
(:goal
(and
(pred_3 obj_02 obj_07)
(pred_3 obj_04 obj_07)
(pred_3 obj_01 obj_07)
)
)

(:constraints
  (always (not (pred_2 obj_13 obj_07)))
)
)

; plan
1. (op_1 obj_09 obj_02 obj_06 obj_05)
   deleted: (pred_3 obj_02 obj_06) (pred_1 obj_09 obj_05)
   added: (pred_4 obj_09 obj_02 obj_05)
   goals met: 0 of 3
2. (op_1 obj_13 obj_04 obj_11 obj_12)
   deleted: (pred_3 obj_04 obj_11) (pred_1 obj_13 obj_12)
   added: (pred_4 obj_13 obj_04 obj_12)
   goals met: 0 of 3
3. (op_2 obj_09 obj_06 obj_07)
   deleted: (pred_2 obj_09 obj_06)
   added: (pred_2 obj_09 obj_07)
   goals met: 0 of 3
4. (op_2 obj_13 obj_11 obj_03)
   deleted: (pred_2 obj_13 obj_11)
   added: (pred_2 obj_13 obj_03)
   goals met: 0 of 3
5. (op_3 obj_09 obj_02 obj_07 obj_05)
   deleted: (pred_4 obj_09 obj_02 obj_05)
   added: (pred_3 obj_02 obj_07) (pred_1 obj_09 obj_05)
   goals met: 1 of 3
6. (op_3 obj_13 obj_04 obj_03 obj_12)
   deleted: (pred_4 obj_13 obj_04 obj_12)
   added: (pred_3 obj_04 obj_03) (pred_1 obj_13 obj_12)
   goals met: 1 of 3
7. (op_2 obj_09 obj_07 obj_03)
   deleted: (pred_2 obj_09 obj_07)
   added: (pred_2 obj_09 obj_03)
   goals met: 1 of 3
8. (op_1 obj_09 obj_01 obj_03 obj_05)
   deleted: (pred_3 obj_01 obj_03) (pred_1 obj_09 obj_05)
   added: (pred_4 obj_09 obj_01 obj_05)
   goals met: 1 of 3
9. (op_2 obj_09 obj_03 obj_07)
   deleted: (pred_2 obj_09 obj_03)
   added: (pred_2 obj_09 obj_07)
   goals met: 1 of 3
10. (op_3 obj_09 obj_01 obj_07 obj_05)
   deleted: (pred_4 obj_09 obj_01 obj_05)
   added: (pred_3 obj_01 obj_07) (pred_1 obj_09 obj_05)
   goals met: 2 of 3
11. (op_2 obj_09 obj_07 obj_03)
   deleted: (pred_2 obj_09 obj_07)
   added: (pred_2 obj_09 obj_03)
   goals met: 2 of 3
12. (op_1 obj_09 obj_04 obj_03 obj_05)
   deleted: (pred_3 obj_04 obj_03) (pred_1 obj_09 obj_05)
   added: (pred_4 obj_09 obj_04 obj_05)
   goals met: 2 of 3
13. (op_2 obj_09 obj_03 obj_07)
   deleted: (pred_2 obj_09 obj_03)
   added: (pred_2 obj_09 obj_07)
   goals met: 2 of 3
14. (op_3 obj_09 obj_04 obj_07 obj_05)
   deleted: (pred_4 obj_09 obj_04 obj_05)
   added: (pred_3 obj_04 obj_07) (pred_1 obj_09 obj_05)
   goals met: 3 of 3
